# -*- coding: utf-8 -*-
import os
import sys
reload(sys)
sys.setdefaultencoding('utf-8')
abspath = os.getcwd()

beijing_data = {
    "attractions" : [u"长安街",u"天安门广场",u"故宫",u"王府井",u"天坛",u"颐和园",u"天安门",u"南锣鼓巷",u"什刹海",\
        u"后海",u"鸟巢",u"奥林匹克公园",u"圆明园",u"王府井大街",u"八达岭",u"水立方",u"前海",u"北京大学",u"西海",\
        u"祈年殿",u"恭王府",u"皇穹宇",u"大栅栏",u"北海公园",u"清华大学",u"雍和宫",u"箭楼",u"正阳门",u"文津街",\
        u"烟袋斜街",u"人民大会堂",u"毛主席纪念堂",u"人民英雄纪念碑",u"景山公园",u"鸦儿胡同",u"安定门",u"国子监"],
    "attractions_class" : {
        u"水立方" : "A", u"鸟巢" : "A", u"奥林匹克公园" : "A", u"皇穹宇" : "B", u"文津街" : "B",\
        u"北海公园" : "B", u"长安街" : "B", u"王府井大街" : "B", u"人民英雄纪念碑" : "B", u"大栅栏" : "B",\
        u"毛主席纪念堂" : "B", u"王府井" : "B", u"天坛" : "B", u"正阳门" : "B", u"故宫" : "B", u"景山公园" : "B",\
        u"天安门广场" : "B", u"祈年殿" : "B", u"箭楼" : "B", u"人民大会堂" : "B", u"天安门" : "B", u"北京大学" : "C",\
        u"圆明园" : "C", u"颐和园" : "C", u"清华大学" : "C", u"后海" : "D",u"西海" : "D",u"烟袋斜街" : "D",\
        u"南锣鼓巷" : "D", u"前海" : "D", u"鸦儿胡同" : "D", u"恭王府" : "D", u"什刹海" : "D", u"安定门" : "E",\
        u"雍和宫" : "E", u"国子监" : "E", u"八达岭" : "F"
        },
    "scores" : {
        "section_scores" : {
            "F_B":0.0269544961111,"E_F":1.59298985241e-05,"B_A":0.0202400894808,"B_C":0.215318095608,\
            "A_F":7.51835838565e-05,"B_F":0.0564533091936,"C_D":0.00287379074484,"A_B":0.0506494800966,\
            "F_C":0.000270391282582,"E_A":2.53458456363e-05,"D_A":0.000552629798565,"A_E":3.22755784694e-05,\
            "D_B":0.396905774323,"D_E":0.00335341761477,"E_D":0.00225193124094,"F_D":0.000274569046942,\
            "C_B":0.15849704114,"E_C":0.000122861266724,"B_D":0.430388995696,"C_F":0.000227707654243,\
            "F_A":0.000344430707472,"D_C":0.00291734241094,"D_F":0.000559813236045,"C_E":0.000106613279261,\
            "F_E":6.22087768752e-06,"C_A":0.0014668077193,"E_B":0.0251122186737,"A_D":0.000686971298767,\
            "B_E":0.0197374132926,"A_C":0.000808926436666
            },
            
        }
}